lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

//*****************************************************************************
//
//! \addtogroup local_ota
//! @{
//
//*****************************************************************************

/* standard includes */
#include <stdlib.h>
#include <string.h>
#ifdef CC32XX
/* driverlib Header files */
#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/driverlib/prcm.h>
#endif
/* TI-DRIVERS Header files */
#include <ti_drivers_config.h>
#include <uart_term.h>
#include <ti/drivers/GPIO.h>
#include <ti/drivers/net/wifi/simplelink.h>
#include <ti/drivers/net/wifi/wlan.h>
#include <ti/drivers/power/PowerCC32XX.h>

/* Example/Board Header files */
#include "local_ota_task.h"
#include "platform.h"
#include "local_ota.h"
#include "link_local_task.h"
#include "ota_archive.h"

/* POSIX Header files */
#include <pthread.h>
#include <time.h>

/* In msecs */
#define PING_INTERVAL           (2000) 
/* In msecs */   
#define PING_TIMEOUT            (2000)
/* In bytes */    
#define PING_PKT_SIZE           (20)      
#define NO_OF_ATTEMPTS          (4)
/* In msecs. Used to detect good/bad sl_start() */
#define ASYNC_EVT_TIMEOUT       (5000) 
/* In msecs */ 
#define LED_TOGGLE_TIMEOUT      (500)   

#define SERVER_CERTIFICATE_FILENAME     "ca_in_cert_store"
#define SERVER_PRIVATE_KEY_FILENAME     "ca-priv-key.der"

/*
 *  \brief  Application state's context
 */
typedef struct  _LocalOta_AppContext_t_
{
    LocalOtaState currentState;        /* Current state of the application */
    uint32_t pendingEvents;            /* Events pending to be processed */
    uint8_t role;                      /* SimpleLink's role - STATION/AP/P2P */
    uint32_t asyncEvtTimeout;          /* Timeout value*/
    uint32_t ledToggleTimeout;         /* Timeout value */
    uint32_t ledIndex;                 /* led index for toggling */
}LocalOta_AppContext;

/*!
 *  \brief  Function pointer to the event handler
 */
typedef int32_t (*fptr_EventHandler)();

/*!
 *  \brief  Entry in the lookup table
 */
typedef struct
{
    fptr_EventHandler p_evtHndl;    /* Pointer to the event handler */
    LocalOtaState nextState;        /* Next state of local ota */
}s_TblEntry;

/******************************************************************************
                      LOCAL FUNCTION PROTOTYPES
******************************************************************************/

static void SetNetAppHttp(int32_t *retVal,
                          const uint8_t Option,
                          const uint8_t OptionLen,
                          const uint8_t *pOptionValue);

//*****************************************************************************
//
//! \brief This function configures the HTTP server
//!
//! \param[in]  none
//!
//! \return NetApp error codes or 0 upon success.
//!
//*****************************************************************************
static int32_t ConfigureHttpServer();

//*****************************************************************************
//
//! \brief Depending upon the triggered events/error, this function traverses
//!         through the application's transition table
//!
//! \param[in]  None
//!
//! \return On success, zero is returned. On error, loops forever
//!
//*****************************************************************************
static int32_t localOtaAppTask();

//*****************************************************************************
//
//! \brief This function starts the SimpleLink in the configured role.
//!         The device notifies the host asynchronously 
//!         when the initialization is completed
//!
//! \param[in]  role    Device shall be configured in this role
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************

static int32_t InitSimplelink(uint8_t const role);

//*****************************************************************************
//! \brief This function handles 'LocalOtaEvent_Started' event and kick off
//!  the procedure
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandleStartConnect();

//*****************************************************************************
//! \brief This function initiates a connection request
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t StartConnection();

//*****************************************************************************
//! \brief This function starts timer for IP address acquisition
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t WaitForIpAddr();

//*****************************************************************************
//! \brief This function configures Simplelink to ping the gateway IP and 
//! check the LAN connection
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t CheckLanConnection();

//*****************************************************************************
//! \brief test for commit flag after ping is completed
//!          if commit is pending, try to commit.
//!          if commit is successful or no commit is required, continue
//!          to ota procedure.
//!          Upon unsuccessful commit, platform reboot is required.
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandlePingComplete();

//*****************************************************************************
//
//! \brief This function stops the network processor and restarts the mcu
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ProcessRestartMcu();

//*****************************************************************************
//
//! \brief This function starts the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StartAsyncEvtTimer();

//*****************************************************************************
//
//! \brief This function stops the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StopAsyncEvtTimer();

//*****************************************************************************
//
//! \brief report SM during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportSM();

//*****************************************************************************
//
//! \brief internal error detection during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportError();
#ifdef CC32XX
//*****************************************************************************
//
//! Notify if device return to factory image
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void NotifyReturnToFactoryImage();
#endif

//*****************************************************************************
//
//! \brief The interrupt handler for the LED timer
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
void LedTimerIntHandler(sigval val);

//*****************************************************************************
//
//! \brief This function handles ping report events
//!
//! \param[in]  pPingReport - Pointer to the structure containing ping report
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkPingReport(SlNetAppPingReport_t *pPingReport);

