lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
/******************************************************************************
                      GLOBAL VARIABLES
******************************************************************************/
/*!
 *  \brief  Application state's context
 */
LocalOta_AppContext gAppCtx;

timer_t gAsyncEventTimer;
timer_t gLedTimer;

/*!
 *  \brief   Application lookup/transition table
 */
const s_TblEntry gTransitionTable[LocalOtaState_Max][LocalOtaEvent_Max] =
{
    /* LocalOtaState_Starting */
    {
        /* LocalOtaEvent_Started          */ {HandleStartConnect,
                                              LocalOtaState_WaitForConnection},
        /* LocalOtaEvent_Connected        */ {ReportError,
                                              LocalOtaState_Error           },
        /* LocalOtaEvent_IpAcquired       */ {ReportError,
                                              LocalOtaState_Error           },
        /* LocalOtaEvent_Disconnected     */ {ProcessRestartMcu,
                                              LocalOtaState_Starting        },
        /* LocalOtaEvent_PingCompleted    */ {ReportError,
                                              LocalOtaState_Error           },
        /* LocalOtaEvent_OtaDownloadDone  */ {ReportError,
                                              LocalOtaState_Error           },
        /* LocalOtaEvent_Timeout          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting        },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error           },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting        }
    },

    /* LocalOtaState_WaitForConnection */
    {
        /* LocalOtaEvent_Started          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Connected        */ {WaitForIpAddr,
                                              LocalOtaState_WaitForIP        },
        /* LocalOtaEvent_IpAcquired       */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Disconnected     */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* LocalOtaEvent_PingCompleted    */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaDownloadDone  */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaError         */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Timeout          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         }
    },

    /* LocalOtaState_WaitForIP */
    {
        /* LocalOtaEvent_Started          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Connected        */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_IpAcquired       */ {CheckLanConnection,
                                              LocalOtaState_PingingGW        },
        /* LocalOtaEvent_Disconnected     */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
/* OTA - on disconnectio/ip lost do rollback 
   by reset, no pending commit check */
        /* LocalOtaEvent_PingCompleted    */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaDownloadDone  */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaError         */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Timeout          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         }
    },

    /* LocalOtaState_PingingGW */
    {
        /* LocalOtaEvent_Started          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Connected        */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_IpAcquired       */ {ReportError,
                                              LocalOtaState_Error            },
        /* OTA - on disconnection/ip lost, do rollback by reset, no pending 
        commit check */
        /* LocalOtaEvent_Disconnected     */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* OTA - on ping complete, check for commit criteria */       
       /* LocalOtaEvent_PingCompleted    */ {HandlePingComplete,
                                              LocalOtaState_OtaRun           },
        /* LocalOtaEvent_OtaDownloadDone  */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaError         */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Timeout          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         }
    },

    /* LocalOtaState_OtaRun */
    {
        /* LocalOtaEvent_Started          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Connected        */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_IpAcquired       */ {ReportError,
                                              LocalOtaState_Error            },
        /* on disconnection/ip lost during OTA, stay in state 
           and wait for ERROR event and only then restart */
        /* LocalOtaEvent_Disconnected     */ {ReportSM,
                                              LocalOtaState_OtaRun           },
        /* LocalOtaEvent_PingCompleted    */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaDownloadDone  */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
         /* OTA fails. restart MCU as files 
            are during commit and need to get "free" */
        /* LocalOtaEvent_OtaError         */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         },
        /* LocalOtaEvent_Timeout          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Starting         }
    },

