lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    /* LocalOtaState_Error */
    {
        /* LocalOtaEvent_Started          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Connected        */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_IpAcquired       */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Disconnected     */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_PingCompleted    */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaDownloadDone  */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_OtaError         */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Timeout          */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Error            */ {ReportError,
                                              LocalOtaState_Error            },
        /* LocalOtaEvent_Restart          */ {ProcessRestartMcu,
                                              LocalOtaState_Error            }
    }
};

LocalOtaTask_CB LocalOtaTask_ControlBlock;

/******************************************************************************
                  Callback Functions
******************************************************************************/

//*****************************************************************************
//
//! \brief This function handles ping report events
//!
//! \param[in]  pPingReport - Pointer to the structure containing ping report
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkPingReport(SlNetAppPingReport_t *pPingReport)
{
    memset(&LocalOta_ControlBlock.pingReport, 0, sizeof(SlNetAppPingReport_t));
    memcpy(&LocalOta_ControlBlock.pingReport, pPingReport,
           sizeof(SlNetAppPingReport_t));

    if(LocalOta_ControlBlock.pingReport.PacketsReceived > 0 &&
       LocalOta_ControlBlock.pingReport.PacketsReceived <= NO_OF_ATTEMPTS)
    {
        UART_PRINT("[Local ota task] pinging to gateway succeeded \n\r");
        SignalEvent(LocalOtaEvent_PingCompleted);
    }
    else
    {
        UART_PRINT(
            "[Local ota task] pinging to gateway failed, no response \n\r");

        /* Restart MCU doing rollback if needed */
        SignalEvent(LocalOtaEvent_Restart);
    }
}

//*****************************************************************************
//
//! \brief The interrupt handler for the async-evt timer
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
void AsyncEvtTimerIntHandler(sigval val)
{
    /* Clear the timer interrupt. */
    Platform_TimerInterruptClear();

    /* One Shot */
    /* TBD - Check role for One-shot/periodic */
    StopAsyncEvtTimer();
    SignalEvent(LocalOtaEvent_Timeout);
}

//*****************************************************************************
//
//! \brief The interrupt handler for the LED timer
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
void LedTimerIntHandler(sigval val)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    /* Clear the timer interrupt. */
    Platform_TimerInterruptClear();

    GPIO_toggle(pCtx->ledIndex);
}

//*****************************************************************************
//                 Local Functions
//*****************************************************************************

static void SetNetAppHttp(int32_t *retVal,
                          const uint8_t Option,
                          const uint8_t OptionLen,
                          const uint8_t *pOptionValue)
{
    if(*retVal >= 0)
    {
        int32_t i;

        *retVal = sl_NetAppSet(SL_NETAPP_HTTP_SERVER_ID, Option, OptionLen,
                               pOptionValue);
        INFO_PRINT("_SetNetAppHttp:: option=%d len=%d (", Option, OptionLen);

        for(i = 0; i < OptionLen; i++)
        {
            INFO_PRINT ("%2d ", pOptionValue[i]);
        }

        INFO_PRINT(")\n\r_SetNetAppHttp:: retval=%d\n\r", *retVal);
    }
}

//*****************************************************************************
//
//! \brief This function configures the HTTP server
//!
//! \param[in]  none
//!
//! \return NetApp error codes or 0 upon success.
//!
//*****************************************************************************
static int32_t ConfigureHttpServer()
{
    int32_t retVal = 0;
    uint8_t serverCACertificateFileName[] = "\0";
    uint8_t httpsPort[] = {0xBB, 0x01};  /* 0x1BB = 443 */
    uint8_t secondaryPort[] = {0x50, 0x00}; /* 0x050 = 80 */
    uint8_t secondaryPortEnable[] = {0x1};
    uint8_t securityMode = 1;

    UART_PRINT("[Local ota task] ConfigureHttpServer for secured mode...\n\r");

    /* Set the file names used for SSL key exchange */
    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_DEVICE_CERTIFICATE_FILENAME,
                  strlen((char *)SSL_SERVER_CERT),
                  (const uint8_t *)SSL_SERVER_CERT);

    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_PRIVATE_KEY_FILENAME,
                  strlen((char *)SSL_SERVER_KEY),
                  (const uint8_t *)SSL_SERVER_KEY);

    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_CA_CERTIFICATE_FILE_NAME,
                  sizeof(serverCACertificateFileName),
                  serverCACertificateFileName);

    /* Activate SSL security on primary HTTP port and change it to
       443 (standard HTTPS port) */
    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_PRIMARY_PORT_SECURITY_MODE,
                  sizeof(securityMode),
                  &securityMode);

    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_PRIMARY_PORT_NUMBER,
                  sizeof(httpsPort),
                  httpsPort);

    /* Enable secondary HTTP port (can only be used for redirecting
       connections to the secure primary port) */
    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_SECONDARY_PORT_NUMBER,
                  sizeof(secondaryPort),
                  secondaryPort);

    SetNetAppHttp(&retVal,
                  SL_NETAPP_HTTP_SECONDARY_PORT_ENABLE,
                  sizeof(secondaryPortEnable),
                  secondaryPortEnable);

    if(retVal >= 0)
    {
        retVal = sl_NetAppStop(SL_NETAPP_HTTP_SERVER_ID);
        UART_PRINT("[Local ota task] HTTP Server Stopped\n\r");
        if(retVal >= 0)
        {
            retVal = sl_NetAppStart(SL_NETAPP_HTTP_SERVER_ID);
            UART_PRINT("[Local ota task] HTTP Server Re-started\n\r");
        }
    }
    return(retVal);
}

//*****************************************************************************
//
//! \brief This function starts the SimpleLink in the configured role.
//!         The device notifies the host asynchronously when the 
//!         initialization is completed
//!
//! \param[in]  role    Device shall be configured in this role
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t InitSimplelink(uint8_t const role)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    int32_t retVal = -1;
#ifdef __MSP432P401R__
    int32_t ret = -1;
#endif

    pCtx->role = role;
    pCtx->currentState = LocalOtaState_Starting;
    pCtx->pendingEvents = 0;

