lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    retVal = sl_Start(0, 0, 0); /* without using SimpleLinkInitCallback */
    if (retVal < 0)
    {
        UART_PRINT("[Local ota task] sl_Start Failed %d \n\r", retVal);
        LOOP_FOREVER();
    }
#ifdef CC32XX
    UART_PRINT("[Local ota task] Device is configured in default state \n\r");
#endif
#ifdef __MSP432P401R__
    ret = ConfigureHttpServer();
    ASSERT_ON_ERROR(ret);
#endif
    if(pCtx->role == retVal)
    {
        UART_PRINT(
            "[Local ota task] SimpleLinkInitCallback: started in role %d\n\r",
            pCtx->role);
        SignalEvent(LocalOtaEvent_Started);
    }
    else
    {
        UART_PRINT(
            "[Local ota task] SimpleLinkInitCallback: started in role %d,"
            " set the requested role %d\n\r",
            retVal, pCtx->role);
        retVal = sl_WlanSetMode(pCtx->role);
        ASSERT_ON_ERROR(retVal);
        retVal = sl_Stop(SL_STOP_TIMEOUT);
        ASSERT_ON_ERROR(retVal);
        retVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(retVal);
        if(pCtx->role != retVal)
        {
            UART_PRINT(
                "[Local ota task] SimpleLinkInitCallback: error setting"
                " role %d, status=%d\n\r",
                pCtx->role, retVal);
            SignalEvent(LocalOtaEvent_Error);
        }
        UART_PRINT(
           "[Local ota task] SimpleLinkInitCallback: restarted in role %d\n\r",
            pCtx->role);
        pCtx->pendingEvents = 0;
        SignalEvent(LocalOtaEvent_Started);
    }

    /* Start timer */
    pCtx->asyncEvtTimeout = ASYNC_EVT_TIMEOUT;
    retVal = StartAsyncEvtTimer(pCtx->asyncEvtTimeout);
    ASSERT_ON_ERROR(retVal);

    return(retVal);
}

//*****************************************************************************
//! \brief This function handles 'LocalOtaEvent_Started' event and kick off the
//!        procedure
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandleStartConnect()
{
    SlDeviceVersion_t firmwareVersion = {0};

    int32_t retVal = -1;
    uint8_t ucConfigOpt = 0;
    uint16_t ucConfigLen = 0;

    /* Get the device's version-information */
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof(firmwareVersion);
    retVal =
        sl_DeviceGet(SL_DEVICE_GENERAL, &ucConfigOpt, &ucConfigLen,
                     (uint8_t *)(&firmwareVersion));
    ASSERT_ON_ERROR(retVal);

    UART_PRINT("[Local ota task] Host Driver Version: %s\n\r",
               SL_DRIVER_VERSION);
    UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r", \
               firmwareVersion.NwpVersion[0], firmwareVersion.NwpVersion[1], \
               firmwareVersion.NwpVersion[2], firmwareVersion.NwpVersion[3], \
               firmwareVersion.FwVersion[0], firmwareVersion.FwVersion[1], \
               firmwareVersion.FwVersion[2], firmwareVersion.FwVersion[3], \
               firmwareVersion.PhyVersion[0], firmwareVersion.PhyVersion[1], \
               firmwareVersion.PhyVersion[2], firmwareVersion.PhyVersion[3]);

    retVal = StartConnection();
    ASSERT_ON_ERROR(retVal);

    return(retVal);
}

//*****************************************************************************
//! \brief This function initiates a connection request
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t StartConnection()
{
    SlWlanSecParams_t secParams = {0};
    int32_t retVal = 0;

    secParams.Key = (signed char*)SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    UART_PRINT("[Local ota task] WlanConnect SSID=%s\n\r", SSID_NAME);
    retVal = sl_WlanConnect((signed char*)SSID_NAME, \
                            strlen(SSID_NAME), 0, &secParams, 0);
    ASSERT_ON_ERROR(retVal);

    retVal = StartAsyncEvtTimer(ASYNC_EVT_TIMEOUT);
    ASSERT_ON_ERROR(retVal);

    return(retVal);
}

//*****************************************************************************
//! \brief This function starts timer for IP address acquisition
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t WaitForIpAddr()
{
    int32_t retVal = 0;

    retVal = StartAsyncEvtTimer(ASYNC_EVT_TIMEOUT);
    ASSERT_ON_ERROR(retVal);

    return(retVal);
}

//*****************************************************************************
//! \brief This function configures Simplelink to ping the gateway IP and check
//!        the LAN connection
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t CheckLanConnection()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    /* LAN connection acquired */
    GPIO_write(CONFIG_GPIO_LED_0, CONFIG_GPIO_LED_ON);

    pCtx->ledIndex = CONFIG_GPIO_LED_2;

    SlNetAppPingCommand_t pingParams = {0};
    SlNetAppPingReport_t pingReport = {0};

    int32_t retVal = -1;

    /* Set the ping parameters */
    pingParams.PingIntervalTime = PING_INTERVAL;
    pingParams.PingSize = PING_PKT_SIZE;
    pingParams.PingRequestTimeout = PING_TIMEOUT;
    pingParams.TotalNumberOfAttempts = NO_OF_ATTEMPTS;
    pingParams.Flags = 0;

    pingParams.Ip = LocalOta_ControlBlock.gatewayIP;

    /* Ping the GW */
    retVal = sl_NetAppPing((SlNetAppPingCommand_t*)&pingParams, \
                           SL_AF_INET, (SlNetAppPingReport_t*)&pingReport, \
                           SimpleLinkPingReport);
    ASSERT_ON_ERROR(retVal);

    /* Compute worst case ping timeout */
    pCtx->asyncEvtTimeout = ((NO_OF_ATTEMPTS * PING_TIMEOUT) + \
                             (NO_OF_ATTEMPTS * PING_INTERVAL) + \
                             (2000)); /* Additional time */

    retVal = StartAsyncEvtTimer(pCtx->asyncEvtTimeout);
    ASSERT_ON_ERROR(retVal);

    UART_PRINT("[Local ota task] Pinging gateway, please wait...\n\r");

