lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    return(retVal);
}

//*****************************************************************************
//
//! \brief This function starts the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StartAsyncEvtTimer(uint32_t timeout)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    pCtx->asyncEvtTimeout = timeout;
    Platform_TimerStart(pCtx->asyncEvtTimeout, gAsyncEventTimer, 0);
    return(0);
}

//*****************************************************************************
//
//! \brief This function stops the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StopAsyncEvtTimer()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    if(0 != pCtx->asyncEvtTimeout)
    {
        Platform_TimerStop(gAsyncEventTimer);
        pCtx->asyncEvtTimeout = 0;
    }

    return(0);
}

//*****************************************************************************
//
//! \brief report SM during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportSM()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            break;
        }
    }

    UART_PRINT("[Local ota task] SM: State = %d, Event = %d\n\r", \
               pCtx->currentState, eventIdx);
    return(0);
}

//*****************************************************************************
//
//! \brief internal error detection during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportError()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            break;
        }
    }

    UART_PRINT("[Local ota task] Unexpected SM: State = %d, Event = %d\n\r", \
               pCtx->currentState, eventIdx);
    return(-1);
}

//*****************************************************************************
//! \brief test for commit flag after ping is completed
//!          if commit is pending, try to commit.
//!          if commit is successful or no commit is required, continue to ota 
//!          procedure.
//!          Upon unsuccessful commit, platform reboot is required.
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandlePingComplete()
{
    int16_t isPendingCommit;

    StopLedEvtTimer();

    /* Turn on GREEN LED when device gets PING response from AP */
    GPIO_write(CONFIG_GPIO_LED_2, CONFIG_GPIO_LED_ON);

    isPendingCommit = OtaArchive_GetPendingCommit();

    if(isPendingCommit)         /* validation of new ota bundle succeeded,
    commit the new ota bundle */
    {
        UART_PRINT("[Local ota task] committing new ota download... \n\r");
        if(OtaArchive_Commit() < 0)
        {
            UART_PRINT(
                "[Local ota task] failed to commit new download, reverting to"
                " previous copy by reseting the device \n\r");
            SignalEvent(LocalOtaEvent_Restart);

            return(-1);
        }
        UART_PRINT("[Local ota task] commit succeeded \n\r");

        /* need to stop the WDT so MCU is not reset */
#ifdef CC32XX
        PowerCC32XX_reset(PowerCC32XX_PERIPH_WDT);
#endif
    }

    UART_PRINT("[Local ota task] waiting for new ota upload... \n\r");

    /* signal to linklocal task */
    sem_post(&LocalOtaTask_ControlBlock.localOtaConnDoneSignal);

    /* signal to report server task */
    sem_post(&LocalOtaTask_ControlBlock.localOtaConnDoneToOtaServerSignal);

    return(0);
}

//*****************************************************************************
//
//! \brief This function stops the network processor and restarts the mcu
//!
//! \param[in]  None
//!
//! \return 0 on success
//!
//*****************************************************************************
static int32_t ProcessRestartMcu()
{
    mcuReboot();

    return(0);
}

//*****************************************************************************
//
//! \brief main local ota loop
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t localOtaAppTask()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    s_TblEntry   *pEntry = NULL;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            if(0 != eventIdx)
            {
                /** Events received - Stop the respective timer if its still
                 * running
                 */
                StopAsyncEvtTimer();
            }

            pEntry =
                (s_TblEntry *)&gTransitionTable[pCtx->currentState][eventIdx];
            if(eventIdx == LocalOtaEvent_Timeout)
            {
                UART_PRINT(
                   "[Local ota task] Handle LocalOtaEvent_Timeout in state=%d,"
                   " next=%d\n\r",
                    pCtx->currentState, pEntry->nextState);
            }
            if(eventIdx == LocalOtaEvent_Error)
            {
                UART_PRINT(
                    "[Local ota task] Handle LocalOtaEvent_Error in state=%d,"
                    " next=%d\n\r",
                    pCtx->currentState, pEntry->nextState);
            }
            if(eventIdx == LocalOtaEvent_Restart)
            {
                UART_PRINT(
                    "[Local ota task] Handle LocalOtaEvent_Restart in state=%d,"
                    " next=%d\n\r",
                    pCtx->currentState, pEntry->nextState);
            }
            pCtx->pendingEvents &= ~(1 << eventIdx);
            if(NULL != pEntry->p_evtHndl)
            {
                if(pEntry->p_evtHndl() < 0)
                {
                    UART_PRINT(
                        "[Local ota task] Event handler failed..!! halt\n\r");
                    LOOP_FOREVER();
                }
            }

            if(pEntry->nextState != pCtx->currentState)
            {
                pCtx->currentState = pEntry->nextState;
            }

            pCtx->pendingEvents &= ~(1 << eventIdx);
        }

