lagerdata/unit-test_templates/cc3235sf/ti_sdk/simplelink_cc32xx_sdk_4_10_00_07/examples/rtos/CC3235SF_LAUNCHXL/demos/local_ota/local_ota_task.c
        /* No more events to handle. Break.! */
        if(0 == pCtx->pendingEvents)
        {
            break;
        }
    }

    usleep(1000);

    return(0);
}

//*****************************************************************************
//
//! Notify if device return to factory image
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
#ifdef CC32XX
static void NotifyReturnToFactoryImage()
{
    if(((HWREG(HIB3P3_BASE + 0x00000418) & (1 << 7)) != 0) &&
       ((HWREG(0x4402F0C8) & 0x01) != 0))
    {
        UART_PRINT("Return To Factory Image successful, Do a power cycle(POR)"
                   " of the device using switch SW1-Reset\n\r");
        while(1)
        {
            ;
        }
    }
}

#endif
//*****************************************************************************
//                            MAIN FUNCTION
//*****************************************************************************

//*****************************************************************************
//
//! \brief The interrupt handler for the async-evt timer
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
int16_t SignalEvent(LocalOtaEvent event)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    pCtx->pendingEvents |= (1 << event);
    return(0);
}

//*****************************************************************************
//
//! \brief This function starts the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
int32_t StartLedEvtTimer(uint32_t timeout)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    pCtx->ledToggleTimeout = timeout;
    Platform_TimerStart(pCtx->ledToggleTimeout, gLedTimer, 1);

    return(0);
}

//*****************************************************************************
//
//! \brief This function stops the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
int32_t StopLedEvtTimer()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    if(0 != pCtx->ledToggleTimeout)
    {
        Platform_TimerStop(gLedTimer);
        pCtx->ledToggleTimeout = 0;
    }

    return(0);
}

//*****************************************************************************
//
//! \brief This is the main local ota task
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
void * localOtaTask(void *pvParameters)
{
    int32_t retVal = -1;
    LocalOta_AppContext     *const pCtx = &gAppCtx;

#ifdef CC32XX
    /* Check the wakeup source. If first time entry or wakeup from HIB */
    if(MAP_PRCMSysResetCauseGet() == 0)
    {
        UART_PRINT("[Local ota task] Wake up on Power ON\n\r");
    }
    else if(MAP_PRCMSysResetCauseGet() == PRCM_HIB_EXIT)
    {
        UART_PRINT("[Local ota task] Woken up from Hibernate\n\r");
    }
#endif
    /* Configure toggle LEDs  */
    GPIO_write(CONFIG_GPIO_LED_0, CONFIG_GPIO_LED_OFF);
    GPIO_write(CONFIG_GPIO_LED_1, CONFIG_GPIO_LED_OFF);
    GPIO_write(CONFIG_GPIO_LED_2, CONFIG_GPIO_LED_OFF);

    Platform_TimerInit(AsyncEvtTimerIntHandler, &gAsyncEventTimer);
    Platform_TimerInit(LedTimerIntHandler, &gLedTimer);

    /* Set the LED toggling timeout and index before starting the timer */
    pCtx->ledIndex = CONFIG_GPIO_LED_0;
    pCtx->ledToggleTimeout = LED_TOGGLE_TIMEOUT;

    StartLedEvtTimer(pCtx->ledToggleTimeout);
#ifdef CC32XX
    /* check whether return-to-default occured */
    NotifyReturnToFactoryImage();

    /*
         IMPORTANT NOTE - This is an example reset function, user must update
                          this function to match the application settings.
     */
    retVal = sl_WifiConfig();
    if(retVal < 0)
    {
        UART_PRINT(
            "[Local ota task] Failed to configure the device in its default"
            " state.., halt\n\r");
        LOOP_FOREVER();
    }
    /* Turn NWP on */
    retVal = sl_Start(NULL, NULL, NULL);
    if (retVal < 0)
    {
        UART_PRINT("[Local ota task] sl_Start Failed %d \n\r", retVal);
        LOOP_FOREVER();
    }

    /* Unregister mDNS services */
    retVal = sl_NetAppMDNSUnRegisterService(0, 0, 0);
    if (retVal < 0)
    {
        UART_PRINT("[Local ota task] Unregister mDNS services Failed %d \n\r", retVal);
        LOOP_FOREVER();
    }

    /* Re-activate HTTP server as secured/non-secured */
    retVal = ConfigureHttpServer();
    if(retVal < 0)
    {
        UART_PRINT("[Local ota task] Failed to configure Http server\n\r");
        LOOP_FOREVER();
    }
    /* For changes to take affect, we restart the NWP */
    retVal = sl_Stop(200);
    if (retVal < 0)
    {
        UART_PRINT("[Local ota task] sl_Stop Failed %d \n\r", retVal);
        LOOP_FOREVER();
    }

#endif
    /* Configure SimpleLink in STATION role */
    retVal = InitSimplelink(ROLE_STA);
    if(retVal < 0)
    {
        UART_PRINT(
            "[Local ota task] Failed to initialize the device!!, halt\n\r");
        LOOP_FOREVER();
    }
    getDeviceType();
    do
    {
        retVal = localOtaAppTask();
    }
    while(!retVal);  /* Exit on failure */

    return(0);
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
